Repository: autohotkey-docs-translation/v2-ja
Catalog: omegat/project_save.tmx
Source language: en
Languages: ja

source: FileOpen in append mode provides more control than FileAppend and allows the file to be kept open rather than opening and closing it each time.
ja: アペンドモードのFileOpenは、FileAppendよりも制御性が高く、毎回ファイルを開いて閉じるのではなく、開いたままにしておくことができます。

source: FileOpen now throws an exception if it fails to open the file.
ja: FileOpenがファイルを開くのに失敗した場合、例外を投げるようになりました。

source: FileOpen provides more advanced functionality than FileRead, such as reading or writing data at a specific location in the file without reading the entire file into memory.
ja: FileOpenは、ファイル全体をメモリに読み込むことなく、ファイルの特定の位置でデータを読み書きするなど、FileReadより高度な機能を提供します。

source: FileOpen returns an object of this type.
ja: FileOpenは、このタイプのオブジェクトを返します。

source: FileOpen, StrGet, StrPut, Reading Binary Data
ja: FileOpen、StrGet、StrPut、バイナリデータの読み取り

source: FileRead translates text between code pages in certain common cases and therefore might output corrupt binary data.
ja: FileReadは、特定の一般的なケースでコードページ間のテキストを変換するため、破損したバイナリデータを出力する可能性があります。

source: FileRead, File-reading loop, Parsing loop, StrSplit, CallbackCreate, A_Clipboard
ja: FileRead、ファイル読み込みループ、解析ループ、StrSplit、CallbackCreate、A_Clipboard

source: FileRead, FileAppend, FileOpen and the File object provide ways of reading and writing text in files with a specific encoding.
ja: FileRead、FileAppend、FileOpen、Fileオブジェクトは、特定のエンコーディングを持つファイル内のテキストの読み書きの方法を提供します。

source: FileSelect, MsgBox, InputBox, ToolTip, GUI, CLSID List, DirCopy, DirMove, SplitPath
ja: FileSelect、MsgBox、InputBox、ToolTip、GUI、CLSIDリスト、DirCopy、DirMove、SplitPath

source: FileSetAttrib and FileSetTime:
ja: FileSetAttribと FileSetTimeです：

source: FileSetAttrib and FileSetTime: the OperateOnFolders and Recurse parameters have been replaced with a single Mode parameter identical to that of Loop Files.
ja: FileSetAttribとFileSetTimeです：OperateOnFoldersとRecurseのパラメータは、Loop Filesと同じ1つのModeパラメータに置き換えられました。

source: FileSetAttrib now overwrites attributes when no +, - or ^ prefix is present, instead of doing nothing.
ja: FileSetAttribは、+、-、^ のプレフィックスが存在しない場合、何もしないのではなく、属性を上書きするようになりました。

source: FileSetTime, FormatTime, FileGetAttrib, FileSetAttrib, FileGetSize, FileGetVersion, file loop, DateAdd, DateDiff
ja: FileSetTime、FormatTime、FileGetAttrib、FileSetAttrib、FileGetSize、FileGetVersion、ファイルループ、DateAdd、DateDiff

source: Finally executes its body when control is being transferred out of a try or catch statement's body.
ja: Finally try文やcatch文の本体から制御が移ったときに、本体を実行します。

source: FindAnywhere: Controls whether each match can be a substring of the input text.
ja: FindAnywhere：各マッチが入力テキストの部分文字列となり得るかどうかを制御します。

source: Flash: Blinks the window and its taskbar button.
ja: Flash：ウィンドウとそのタスクバーボタンを点滅させます。

source: Float
ja: 浮動小数点数

source: Float.
ja: 浮動小数点数

source: Floor: Returns a number rounded down to the nearest integer.
ja: Floor：最も近い整数に切り捨てた数値を返します。

source: Focus: Sets keyboard focus to the control.
ja: Focus：コントロールにキーボードフォーカスを設定します。

source: Focused: Retrieves the focus state of the control.
ja: Focused：コントロールのフォーカス状態を取得します。

source: For-loop, OwnProps, __Enum (Array), __Enum (Map)
ja: Forループ、OwnProps、__Enum（Array）、__Enum（Map）

source: For executes a statement once for each value or pair of values returned by an enumerator, such as each key-value pair in an object.
ja: Forは、オブジェクトのキーと値のペアのように、列挙者が返す値や値のペアごとにステートメントを1回実行します。

source: Format option "LongDate".
ja: フォーマットオプション「LongDate」。

source: Format option "Time".
ja: フォーマットオプション「Time」。

source: Format option blank/omitted.
ja: フォーマットオプションが空白/省略。

source: Format can also be used for case conversions, as shown below:
ja: 次のように、Format関数は同じように大文字小文字の変換をします：

source: Func.IsByRef() now works with built-in functions.
ja: Func.IsByRef()が組み込み関数で動作するようになりました。

source: Function Definitions, Control Flow Statements, If, Else, Loop Statements, Try, Catch, Finally
ja: 関数定義、制御フロー文、If、Else、Loop文、Try、Catch、Finally

source: Function Object
ja: 機能オブジェクト

source: Function Object or Menu
ja: 機能オブジェクトまたはMenu

source: Function call statements are similar to expression statements, but are technically not pure expressions.
ja: 関数呼び出し文は式文と似ていますが、技術的には純粋な式ではありません。

source: Function call statements cannot be variadic; that is, the parameter list must be enclosed in parentheses (or brackets for a property).
ja: 関数呼び出し文は可変型にはできません。つまり、パラメータリストは括弧（プロパティの場合は括弧）で囲む必要があります。

source: Function objects:
ja: 機能オブジェクト：

source: Function objects: Objects which can be called.
ja: 機能オブジェクト：呼び出すことができるオブジェクト。

source: Function and method calls require there to be no space between the function/method name and (.
ja: 関数とメソッド呼び出しでは、関数・メソッド名と(の間にスペースを入てはいけません。

source: Functions, Exit, ExitApp
ja: 関数、Exit、ExitApp

source: Functions, IsLabel, Goto, Break, Continue
ja: 関数、IsLabel、Goto、Break、Continue

source: Functions:
ja: 関数：

source: GNU General Public License
ja: GNU一般公衆ライセンス

source: GUI, Threads, Thread, Critical, #NoTrayIcon, Functions, Return, SetTimer
ja: GUI、スレッド、Thread、Critical、#NoTrayIcon、関数、Return、SetTimer

source: General Math:
ja: 一般的な数学関数です：

source: General Properties:
ja: 一般特性：

source: General Remarks:
ja: 一般的な備考：

source: Get: Returns the value associated with a key, or a default value.
ja: Get：キーに関連する値、またはデフォルト値を返します。

source: Get: Returns the value at a given index, or a default value.
ja: Get：指定されたインデックスにある値、またはデフォルト値を返します。

source: GetChild: Returns the ID number of the specified item's first/top child.
ja: GetChild：指定された項目の先頭/末尾の子の ID 番号を返します。

source: GetClientPos: Retrieves the position and size of the window's client area.
ja: GetClientPos：ウィンドウのクライアントエリアの位置とサイズを取得します。

source: GetCount: Returns the number of rows or columns in the control.
ja: GetCount：コントロールの行数または列数を返します。

source: GetCount: Returns the total number of items in the control.
ja: GetCount：コントロール内の項目の総数を返します。

source: GetKeyName now returns the non-Numpad names for VK codes that correspond to both a Numpad and a non-Numpad key.
ja: NumpadキーとNumpad以外のキーの両方に対応するVKコードのNumpad以外の名前をGetKeyNameで返すようにしました。

source: GetKeySC, GetKeyName, GetKeyState, Key List, Format
ja: GetKeySC、GetKeyName、GetKeyState、キーリスト、Format

source: GetKeyState can retrieve the physical state of a button.
ja: GetKeyStateは、ボタンの物理的な状態を取得することができます。

source: GetKeyState can retrieve the physical state of a key.
ja: GetKeyStateは、キーの物理的な状態を取得することができます。

source: GetKeyState now always returns 0 or 1.
ja: GetKeyStateが常に 0 または 1 を返すようになりました。

source: GetKeyState, Key List, InputHook, KeyHistory, InstallKeybdHook, InstallMouseHook, ClipWait, WinWait
ja: GetKeyState、キーリスト、InputHook、KeyHistory、InstallKeybdHook、InstallMouseHook、ClipWait、WinWait

source: GetKeyVK, GetKeyName, GetKeyState, Key List, Format
ja: GetKeyVK、GetKeyName、GetKeyState、キーリスト、Format

source: GetKeyVK, GetKeySC, GetKeyState, Key List
ja: GetKeyVK、GetKeySC、GetKeyState、キーリスト

source: GetMethod: Retrieves the implementation function of a method.
ja: GetMethod：メソッドの実装関数を取得します。

source: GetNext: Returns the ID number of the next item below the specified item.
ja: GetNext：指定された項目の次の項目の ID 番号を返します。

source: GetNext: Returns the row number of the next selected, checked, or focused row.
ja: GetNext：次に選択、チェック、またはフォーカスされた行の行番号を返します。

source: GetOwnPropDesc can be used to differentiate value properties from dynamic properties, while also retrieving the value or getter/setter/method.
ja: GetOwnPropDescは、値プロパティと動的プロパティを区別するために使用でき、同時に値またはゲッター/セッター/メソッドを取得することもできます。

source: GetOwnPropDesc: Returns a descriptor for a given own property, compatible with DefineProp.
ja: GetOwnPropDesc：DefinePropと互換性のある、与えられた自身のプロパティの記述子を返します。

source: GetPos: Retrieves the position and size of the control.
ja: GetPos：コントロールの位置と大きさを取得します。

source: GetPos: Retrieves the position and size of the window.
ja: GetPos：ウィンドウの位置と大きさを取得します。

source: GetPrev: Returns the ID number of the sibling above the specified item.
ja: GetPrev：指定された項目の上にある兄弟の ID 番号を返します。

source: GetSelection: Returns the selected item's ID number.
ja: GetSelection：選択された項目の ID 番号を返します。

source: GetText: Retrieves the text at the specified row and column number.
ja: GetText：指定された行番号と列番号のテキストを取得する。

source: GetText: Retrieves the text/name of the specified item.
ja: GetText：指定された項目のテキスト/名前を取得します。

source: Global variables which are only read by the function, not assigned or used with the reference operator (&).
ja: グローバル変数で、関数が読み込むだけで、代入したり、参照演算子(&)で使用したりはしない。

source: Goto jumps to the specified label and continues execution.
ja: Gotoは指定されたラベルにジャンプして実行を継続します。

source: Goto, Break and Continue require an unquoted label name, similar to v1 (goto label jumps to label:).
ja: Goto、Break、Continueは、v1の（goto labelがlabel:に飛ぶ）と同様、引用符のないラベル名を必要とします。

source: Goto, break and continue require an unquoted label name, similar to v1 (goto label jumps to label:).
ja: Goto、break、continueは、v1の（goto labelがlabel:に飛ぶ）と同様、引用符のないラベル名を必要とします。

source: GroupActivate activates the next window that matches criteria specified by a window group.
ja: GroupActivateは、ウィンドウグループで指定された条件に一致する次のウィンドウをアクティブにする。

source: GroupActivate now returns the HWND of the window which was selected for activation, or 0 if there were no matches (aside from the already-active window), instead of setting ErrorLevel.
ja: GroupActivateは、ErrorLevelを設定する代わりに、アクティブ化のために選択されたウィンドウのHWND、または（すでにアクティブなウィンドウを除いて）一致しなかった場合は0を返すようになりました。

source: GroupActivate sets ErrorLevel only in v1.1, not v1.0 or v2.0.
ja: GroupActivateでErrorLevelを設定するのはv1.1のみで、v1.0やv2.0では設定しない。

source: GroupAdd's Label parameter behaves differently between v1.0 and v1.1, but was removed in v2.0.
ja: GroupAddのLabelパラメータはv1.0とv1.1で挙動が異なりますが、v2.0では削除されています。

source: GroupAdd: Removed the Label parameter and related functionality.
ja: GroupAdd：Labelパラメータと関連する機能を削除しました。

source: GroupDeactivate now selects windows in a manner closer to the Alt+Esc and Alt+Shift+Esc system hotkeys and the taskbar.
ja: GroupDeactivateは、Alt+EscおよびAlt+Shift+Escシステム ホットキーとタスク バーに近い方法でウィンドウが選択されるようになりました。

source: Gui object, MsgBox, FileSelect, DirSelect, ToolTip, InputHook
ja: Guiオブジェクト、MsgBox、FileSelect、DirSelect、ToolTip、InputHook

source: Gui(), Gui object, GuiControl object, GuiCtrlFromHwnd, Control Types, ListView, TreeView, Menu object, Control functions, MsgBox, FileSelect, DirSelect
ja: Gui()、Guiオブジェクト、GuiControlオブジェクト、GuiCtrlFromHwnd、コントロール、ListView、TreeView、Menuオブジェクト、Control関数、MsgBox、FileSelect、DirSelect

source: Gui(), Gui object, GuiControl object, GuiFromHwnd, Control Types, ListView, TreeView, Menu object, Control functions, MsgBox, FileSelect, DirSelect
ja: Gui()、Guiオブジェクト、GuiControlオブジェクト、GuiFromHwnd、コントロール、ListView、TreeView、Menuオブジェクト、Control関数、MsgBox、FileSelect、DirSelect

source: Gui.Add() defaults to y+m/x+m instead of yp/xp when xp/yp or xp+0/yp+0 is used.
ja: Gui.Addは、yp/xpの代わりにxp/pまたはxp+0/p+0が使用されていた場合はy+m/x+mがデフォルトとなる。

source: Gui.Add, Gui.__Item and GuiCtrlFromHwnd return an object of this type.
ja: Gui.Add、Gui.__Item、GuiCtrlFromHwndは、このタイプのオブジェクトを返します。

source: Gui.AddPicture (and GuiCtrl.Value when setting a Picture control's content).
ja: Gui.AddPicture（ピクチャコントロールのコンテンツを設定する場合はGuiCtrl.Value）。

source: Gui.Show automatically does a Sleep -1, so it is generally not necessary to call Sleep in that case.
ja: Gui.Showは、自動的にSleep -1を行うので、その場合は一般にSleepを呼び出す必要はない。

source: Gui.Submit has no effect on a ListView control.
ja: Gui.Submitは、ListViewコントロールには効果がありません。

source: Gui or String (empty)
ja: Gui または String (empty)

source: Gui: Retrieves the Gui object of the control's parent window.
ja: Gui：コントロールの親ウィンドウのGuiオブジェクトを取得します。

source: GuiControl object, GuiFromHwnd, GuiCtrlFromHwnd, Control Types, ListView, TreeView, Menu object, Control functions, MsgBox, FileSelect, DirSelect
ja: GuiControlオブジェクト、GuiFromHwnd、GuiCtrlFromHwnd、コントロール、ListView、TreeView、Menuオブジェクト、Control関数、MsgBox、FileSelect、DirSelect

source: GuiControl or String (empty)
ja: GuiControlまたはString(空)

source: GuiCtrl.Value returns the same object each time, whereas GuiControlGet created a new wrapper object each time.
ja: GuiCtrl.Valueは毎回同じオブジェクトを返しますが、GuiControlGetは毎回新しいラッパーオブジェクトを作成しました。

source: GuiObj.Add defaults to y+m/x+m instead of yp/xp when xp/yp or xp+0/yp+0 is used.
ja: GuiObj.Addは、yp/xpの代わりにxp/pまたはxp+0/p+0が使用されていた場合はy+m/x+mがデフォルトとなる。

source: Handle: Retrieves a system file handle, intended for use with DllCall.
ja: Handle：DllCallで使用することを目的としたシステムファイルハンドルを取得することができます。

source: Handle: Retrieves the menu's Win32 handle.
ja: Handle：メニューのWin32ハンドルを取得します。

source: Has: Returns true if the specified key has an associated value within a map.
ja: Has：指定されたキーがマップ内に関連する値を持つ場合、true を返す。

source: HasMethod: Returns true if the value has a method by this name.
ja: HasMethod：値がこの名前のメソッドを持つ場合、trueを返す。

source: HasOwnProp: Returns 1 (true) if an object owns a property by the specified name.
ja: HasOwnProp：オブジェクトが指定された名前のプロパティを所有している場合、1 (true)を返します。

source: HasProp: Returns true if the value has a property by this name.
ja: HasProp：値がこの名前のプロパティを持つ場合、trueを返す。

source: Hide: Hides the window.
ja: Hide：ウィンドウを隠します。

source: HotIf (formerly "Hotkey If") now recognizes expressions which use the and or or operators.
ja: HotIf（旧Hotkey If）は、andまたはor演算子を使用した式を認識するようになりました。

source: Hotkey Symbols, HotIf, A_ThisHotkey, #MaxThreadsBuffer, #MaxThreadsPerHotkey, Suspend, Threads, Thread, Critical, Return, Menu object, SetTimer
ja: ホットキー記号、HotIf、A_ThisHotkey、#MaxThreadsBuffer、#MaxThreadsPerHotkey、Suspend、スレッド、Thread、Critical、Return、Menuオブジェクト、SetTimer

source: Hotkey function, Hotkeys, Hotstrings, Suspend, WinActive, WinExist, SetTitleMatchMode, DetectHiddenWindows
ja: Hotkey関数、ホットキー、ホットストリング、Suspend、WinActive、WinExist、SetTitleMatchMode、DetectHiddenWindows

source: Hotkey and Hotstring now support the S option to make the hotkey/hostring exempt from Suspend (equivalent to the new #SuspendExempt directive), and the S0 option to disable exemption.
ja: Hotkeyと Hotstringで、Suspendを免除するSオプション（新しい#SuspendExempt指令と同等）と、免除を無効にするS0オプションが追加されました。

source: Hotkey no longer defaults to the script's bottommost #HotIf (formerly #If).
ja: ホットキーのデフォルトが、スクリプトの一番下の#HotIf（旧#If）にならないようになりました。

source: Hotkey no longer has a UseErrorLevel option, and never sets ErrorLevel.
ja: Hotkeyに UseErrorLevelオプションがなくなり、ErrorLevelを設定しないようになりました。

source: Hotkey's Action parameter now requires a function object or hotkey name.
ja: HotkeyのActionパラメータに、関数オブジェクトまたはホットキー名を指定するようになりました。

source: Hotkey's Callback parameter now requires a function object or hotkey name.
ja: HotkeyのCallbackパラメータに、関数オブジェクトまたはホットキー名を指定するようになりました。

source: Hotkey, Slider, Tab and Link.
ja: Hotkey、Slider、Tab および Link。

source: Hotkeys and non-autoreplace hotstrings are no longer labels; instead, they (automatically) define a function.
ja: ホットキーや自動置換でないホットストリングは、ラベルではなくなり、代わりに（自動的に）機能を定義するようになりました。

source: Hotkeys can also be defined this way.
ja: ホットキーもこのように定義することができます。

source: Hotkeys consist of a hotkey followed by double-colon.
ja: ホットキーは、ホットキーの後にダブルコロンが続く。

source: Hotkeys, Hotstrings, Hotkey function, Hotstring function, #HotIf, Threads
ja: ホットキー、ホットストリング、Hotkey関数、Hotstring関数、#HotIf、スレッド

source: Hotstrings can also be defined this way.
ja: ホットストリングは、このように定義することもできます。

source: Hotstrings consist of a colon, zero or more options, another colon, an abbreviation and double-colon.
ja: ホットストリングは、コロン、0個以上のオプション、もう1つのコロン、省略形、ダブルコロンで構成される。

source: Hotstrings use #InputLevel only to determine whether the last typed character should trigger a hotstring.
ja: ホットストリングは、最後に入力された文字がホットストリングをトリガーするかどうかを判断するために#InputLevelのみを使用します。

source: Hotstrings, #HotIf, A_ThisHotkey, #MaxThreadsPerHotkey, Suspend, Threads, Thread, Critical
ja: ホットストリング、#HotIf、A_ThisHotkey、#MaxThreadsPerHotkey、Suspend、スレッド、Thread、Critical

source: Hwnd: Retrieves the window handle (HWND) of the control.
ja: Hwnd：コントロールのウィンドウハンドル(HWND)を取得します。

source: Hwnd: Retrieves the window handle (HWND) of the window.
ja: Hwnd：ウィンドウのウィンドウハンドル（HWND）を取得します。

source: IPart::Activate is called for each Subunit unique to the given Component.
ja: IPart::Activateは、与えられたComponentに固有の各Subunitに対して呼び出される。

source: If expression: The expression evaluated to false.
ja: If expression：式がfalseに評価された。

source: If, Else, Blocks
ja: If、Else、ブロック

source: If, While, Return, Until, Loop Count and Goto allow an open parenthesis to be used immediately after the name, to enclose the entire parameter list.
ja: If、While、Return、Until、LoopCount、および、Gotoでは、名前の直後に開括弧を使用し、パラメータリスト全体を囲むことができます。

source: ImageLists (the means by which icons are added to a ListView)
ja: ImageLists（ListViewにアイコンを追加する手段）

source: ImageSearch returns 1 (true) if the image was found, 0 (false) if it was not found, or throws an exception if the search could not be conducted.
ja: ImageSearchは、画像が見つかった場合は 1 (true)、見つからなかった場合は 0 (false)を返し、検索ができなかった場合は例外を投げる。

source: ImageSearch returns true if the image was found, false if it was not found, or throws an exception if the search could not be conducted.
ja: ImageSearchは、画像が見つかった場合は true、見つからなかった場合は false を返し、検索ができなかった場合は例外を投げる。

source: Implementation - Reference Counting, Pointers to Objects
ja: 実施：参照カウント、オブジェクトへのポインタ

source: InStr can be used to check whether a given modifier (such as >! or ^) is present.
ja: InStrは、与えられた修飾語（>!や ^など）が存在するかどうかをチェックするために使用することができます。

source: InStr's CaseSensitive parameter has been replaced with CaseSense, which can be 0, 1 or "Locale".
ja: InStrのCaseSensitiveパラメータがCaseSenseに変更され、0、1または「Locale」が指定できるようになりました。

source: Includes a file prior to the main script.
ja: メインスクリプトの前にファイルを含む。

source: IniDelete, IniRead and IniWrite set A_LastError to the result of the operating system's GetLastError() function.
ja: IniDelete、IniRead、IniWriteは、A_LastErrorをオペレーティングシステムのGetLastError()関数の結果に設定します。

source: IniDelete, IniWrite, RegRead, file-reading loop, FileRead
ja: IniDelete、IniWrite、RegRead、ファイル読み込みループ、FileRead

source: IniRead throws an exception if the requested key, section or file cannot be found and the Default parameter was omitted.
ja: 要求されたキー、セクション、ファイルが見つからず、Defaultパラメータが省略された場合、IniReadは例外を投げる。

source: Input: Returns any text collected since the last time Input was started.
ja: Input：前回Inputを起動してから収集したテキストを返します。

source: InputBox has been given a syntax overhaul to make it easier to use (with fewer parameters).
ja: InputBoxは、より使いやすくなるように構文が見直されました（パラメータが少なくなっています）。

source: InputBox returns an object with result (OK, Cancel or Timeout) and value properties.
ja: InputBoxは、結果（OK、Cancel、Timeout）および値のプロパティを持つオブジェクトを返します。

source: InputBox returns an object with Result (OK, Cancel or Timeout) and Value properties.
ja: InputBoxは、Result（OK、Cancel、Timeout）およびValueのプロパティを持つオブジェクトを返します。

source: InputBox, FileSelect, DirSelect, ToolTip, Gui object
ja: InputBox、FileSelect、DirSelect、ToolTip、Guiオブジェクト

source: InputHook now treats Shift+Backspace the same as Backspace, instead of transcribing it to `b.
ja: InputHookが Shift+Backspaceを Backspaceと同じように扱うようになり、代わりに`bに転写されるようになりました。

source: Insert: Inserts a new item before the specified item.
ja: Insert：指定された項目の前に、新しい項目を挿入します。

source: Insert: Inserts a new row at the specified row number.
ja: Insert：指定された行番号に新しい行を挿入する。

source: InsertAt is a method used to insert new values at a specific position within an Array, but other kinds of objects may also define a method by this name.
ja: InsertAtは、配列内の特定の位置に新しい値を挿入するために使われるメソッドだが、他の種類のオブジェクトでもこの名前のメソッドを定義することができる。

source: InsertAt: Inserts one or more values at a given position.
ja: InsertAt：指定された位置に1つまたは複数の値を挿入します。

source: InsertCol: Inserts a new column at the specified column number.
ja: InsertCol：指定されたカラム番号に新しいカラムを挿入します。

source: InstallMouseHook, #UseHook, Hotkey, InputHook, KeyHistory, Hotstrings, GetKeyState, KeyWait
ja: InstallMouseHook、#UseHook、Hotkey、InputHook、KeyHistory、ホットストリング、GetKeyState、KeyWait

source: Integer (boolean)
ja: 整数（ブーリアン）

source: Integer (boolean), Float or Integer
ja: 整数（ブーリアン）、浮動小数点または整数

source: Integer
ja: 整数

source: Integer or Float
ja: 整数または浮動小数点数

source: Integer or String (empty)
ja: 整数または文字列（空）

source: Integer or String
ja: 整数または文字列

source: Integer or empty string
ja: 整数または空文字列

source: Integer, object or String
ja: Integer, object または String

source: Integer.
ja: 整数

source: Interactive debugging, such as to step through the script line by line and inspect variables at each step, or to view and modify variables or objects, beyond what ListVars allows.
ja: 例えば、スクリプトを一行ずつ読み進め、各ステップで変数を検査したり、ListVarsで可能な範囲を超えて変数やオブジェクトを表示したり変更したりする、インタラクティブなデバッグが可能です。

source: Interrupt: Changes the duration of interruptibility for newly launched threads.
ja: Interrupt：新しく起動されたスレッドの割り込み可能時間を変更する。

source: IsByRef: Determines whether a parameter is ByRef.
ja: IsByRef：パラメータがByRefであるかどうかを判定します。

source: IsOptional: Determines whether a parameter is optional.
ja: IsOptional：パラメータがオプションであるかどうかを判定します。

source: IsSet can be used to avoid the error and Try/Catch or OnError can be used to handle it.
ja: IsSetでエラーを回避し、Try/CatchまたはOnErrorで処理することができます。

source: IsSet can be used to avoid the error and try/catch or OnError can be used to handle it.
ja: IsSetでエラーを回避し、try/catchまたはOnErrorで処理することができます。

source: IsSet can be used to detect this condition.
ja: IsSetはこの状態を検出するために使われます。

source: IsSet can be used to determine whether a variable has been initialized, such as to initialize a global or static variable on first use.
ja: IsSetは、グローバル変数やスタティック変数の初回使用時の初期化など、変数が初期化されているかどうかを判断するために使用することができます。

source: IsXXX: The legacy command "if Var is Type" has been replaced with a series of functions: IsAlnum, IsAlpha, IsDigit, IsFloat, IsInteger, IsLower, IsNumber, IsSpace, IsUpper, IsXDigit.
ja: IsXXX： レガシーコマンドである「if Var is Type」は、一連の関数に置き換えられています：IsAlnum、IsAlpha、IsDigit、IsFloat、IsInteger、IsLower、IsNumber、IsSpace、IsUpper、IsXDigit。

source: Jim Biancolo and Wikipedia's Lists of Common Misspellings
ja: Jim Biancoloと ウィキペディアのよくある誤字脱字リスト

source: Joystick remapping: Methods of sending keystrokes and mouse clicks with a joystick.
ja: ジョイスティックのリマッピング：ジョイスティックでキーストロークやマウスクリックを送信する方法。

source: Joystick-To-Mouse script:
ja: Joystick-To-Mouseのスクリプト：

source: KeyHistory can be used to display the last 20 keystrokes (for debugging purposes).
ja: KeyHistoryは、過去20回のキー入力を表示することができます（デバッグ用）。

source: KeyHistory can be used to monitor mouse clicks.
ja: KeyHistoryは、マウスのクリックを監視するために使用することができます。

source: KeyOpt: Sets options for a key or list of keys.
ja: KeyOpt：キーまたはキーのリストに対するオプションを設定します。

source: KeyWait now returns 0 (false) if the wait period expires, otherwise 1 (true).
ja: KeyWaitは、待ち時間が終了した場合は0 (false)を、そうでない場合は1 (true)を返すようになりました。

source: KeyWait now returns 0 if the wait period expires, otherwise 1.
ja: KeyWaitは、待ち時間が終了した場合は0を、そうでない場合は1を返すようになりました。

source: KeyWait, Hotstrings, InputBox, InstallKeybdHook, Threads
ja: KeyWait、ホットストリング、InputBox、InstallKeybdHook、スレッド

source: Length returns the number of items in the array.
ja: Lengthは、配列の項目数を返します。

source: Length: Retrieves or sets the length of an array.
ja: Length：配列の長さを取得または設定します。

source: Length: Retrieves or sets the size of the file.
ja: Length：ファイルサイズを取得または設定します。

source: Let: Sets a user variable.
ja: Let：ユーザー変数を設定する。

source: Link: The link's HREF attribute.
ja: Link：リンクのHREF属性です。

source: Link: The link's ID attribute (a string) if it has one, otherwise the link's index (an integer).
ja: Link：リンクにID属性がある場合は文字列、ない場合はリンクのインデックス（整数値）です。

source: ListLines allows blank or boolean.
ja: ListLinesでは、空白またはブーリアンが使用できます。

source: ListLines, KeyHistory, and OutputDebug.
ja: ListLines, KeyHistory, および OutputDebug.

source: ListVars now shows static variables separately to local variables.
ja: ListVarsで、静的変数とローカル変数を分けて表示するようにしました。

source: ListView and TreeView:
ja: ListView および TreeView:

source: ListView, Other Control Types, Gui(), ContextMenu event, Gui object, GuiControl object, TreeView styles table
ja: ListView、その他のコントロールタイプ、Gui()、ContextMenuイベント、Guiオブジェクト、GuiControlオブジェクト、TreeViewのスタイルの表

source: ListView, TreeView and StatusBar:
ja: ListView、TreeViewおよびStatusBar：
